resources/www/building-a-stack.org
#+HTML: <div class="container-fluid"><div class="row"><div class="col-md-7 col-md-offset-3 col-xs-12 col-sm-10 col-sm-offset-1 col-lg-6 col-lg-offset-3">
#+TITLE: Building a Stack
#+HTML: <br><br>

Building systems is usually seen as a hard topic for senior people only
but it's really something that every engineer should take a hard look
at. By writing programs we are all building some component of a larger
system. This begs the question, why not take the time to focus on
engineering the system itself? Are there ways that we can apply program
level constructs to system design? What would it be like to create
an entire system?

* Systems 101

  Last month I wrapped up projects for my Senior Web Developer Nanodegree
  from Udacity and had a free month to work on whatever I wanted. OK, I
  could have jumped straight into the job market but I wanted to dig into
  distributed systems while I had the chance. How many times on the job
  does an engineer get to build an entire system? Likely none. There's
  usually already a system in place or, at best, you'll work with other
  people and be left with a subset of the system that you own. That's OK
  but how would someone design a system given the opportunity? What kind
  of stuff could one learn to get ready for it? What kind of tricks
  could you pick up along the way?

#+HTML: <br>

  As you're probably getting the hint, this was way too tempting not to
  investigate. :-)

#+HTML: <br>

  To begin, I tried categorizing common parts of a system. This won't be
  universal since different systems have different objectives but here's a
  basic list:

- Front-end: Web or App interface to a service
- Back-end: App servers, Web servers, Microservices, 3rd Party, etc.
- Components: Tools for caching, queuing, load balancing, etc.
- Database: How info gets processed and stored long-term and short-term
- Analytics: Data Science things
- OAM: Operations, Administration, and Management
- Computing Platform: Physical servers, OS, Cloud Platform, etc.

#+HTML: <br>

I've seen some people talk about how putting these parts together is
like snapping LEGO blocks together and magically ending up with a
system. While that would probably work for a mental model, that doesn't
quite carry over to the real world. Much like how programs have errors
and error handling, systems have errors too (network outages, hardware
spontaneously busting, cats accidentally pulling cords out) and the
system has to handle whatever can be thrown at it.

#+HTML: <br>

* Errors

  The basic trade-off for error handling is described by [[https://en.wikipedia.org/wiki/Cap_theorem][CAP
  theorem]]. The gist is that out of the three options of consistency,
  availability, or partition tolerance, a system can only have two of
  the three. In practice, partition tolerance is always assumed because
  people host out of stable data centers that have good uptimes. That
  leaves a choice between capacity and availability. I think many
  systems end up somewhere in between the two by using eventual
  consistency via CRDTs, [[https://en.wikipedia.org/wiki/Quorum_(distributed_computing)][quorums]], client-side storage, and other techniques.

#+HTML: <br>

  (Well, people don't always really get partition tolerance because they
  usually don't use redundant services to host their systems. It ends up
  costing more and the SLAs for hosting usually promise one or two
  nines, which is good enough. That said, I've seen major hosting
  providers have multi-day outages for a zone which crashed lots of web
  services. Just a few weeks ago Dyn DNS went out along with all the
  services that used it as a single point of failure: Twitter, GitHub,
  Reddit, Paypal, Spotify, and others. Having redundant DNS or hosting
  providers could have avoided the problems but it's a design decision
  for their system: cost vs fault tolerance.)

#+HTML: <br>

  There's also the case of acute errors like when an HDD breaks. To
  recover from these kinds of problems, the OAM layer should be
  monitoring the server's health and handle the problem
  automatically. The general idea is that the server will be marked as
  down due to hardware failure, the traffic will be distributed to other
  servers, and a notification will go out to a human that's on call
  somewhere. Runtime exceptions and other normal problems should be
  written to a log and possibly ping a team member if it demands attention.

#+HTML: <br>

* Scaling

  Designing for scale is another tricky challenge. There are usually two
  methods of scaling a system: vertically (adding more cores per node)
  or horizontally (adding more nodes to a network). Some programming
  languages definitely scale better than others but pretty much any
  language can be Franken-programmed into scaling both vertically and
  horizontally nowadays. Single threaded servers like Node.js can be
  hosted with IIS so that each computer core is given an instance of the
  server program to run. Load balancers can have different methods to
  partition the network load across nodes for horizontal scaling.

#+HTML: <br>

  [[https://www.youtube.com/watch?v=xrIjfIjssLE][Erlang]], being the language of distributed systems, is the only
  language I'm aware of that can do both horizontal and vertical
  scaling. Similar to how Java or C has threads, Erlang has sandboxed
  processes. The difference is that a normal computer can support
  millions of concurrent Erlang processes and networks can distribute
  the processes transparently across nodes. There are lots of other
  language features that make [[https://www.youtube.com/watch?v=rRbY3TMUcgQ][Erlang]] great for building systems in
  too. For more, I'd highly suggest reading:

- [[http://erlang.org/pipermail/erlang-questions/2014-November/081570.html][this post]]
- [[http://erlang.org/download/armstrong_thesis_2003.pdf][the original white paper]]
- [[http://learnyousomeerlang.com/content][Learn You Some Erlang for Great Good]]
- [[https://www.amazon.com/Designing-Scalability-Erlang-OTP-Fault-Tolerant/dp/1449320732][Designing for Scalability with Erlang/OTP: Implement Robust, Fault-Tolerant Systems]]

#+HTML: <br>

  Other tools like CDNs, Redis, or Memcache are great for caching static
  content for web servers too.

#+HTML: <br>

