resources/public/building-a-stack.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Building a Stack</title>
<!-- 2016-11-12 Sat 23:04 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ed Babcock (greenyouse)" />
<meta  name="description" content="Hacks, projects, and general butt-kicking with Ed (greenyouse)"
 />
<meta  name="keywords" content="Clojure, ClojureScript, greenyouse, LISP" />
<meta name='viewport' content='width=device-width' initial-scale=1>
                     <link rel='stylesheet' href='/css/bootstrap.min.css' type='text/css'/>
                     <link rel='stylesheet' href='/css/blog.css' type='text/css'/>
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar navbar-default">
    <div class="container-fluid">
      <div class="navbar-header">
        <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#main-navbar">
          <span class="sr-only">Toggle navigation</span>
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
        </button>
        <a class="navbar-brand" href="/index.html">EDBABCOCK</a>
      </div>
      <div class="collapse navbar-collapse" id="main-navbar">
        <ul class="nav navbar-nav">
          <li><a href="/about.html">About</a></li>
          <li><a href="categories.html">Categories</a></li>
        </ul>
      </div>
    </div>
  </nav>
</div>
<div id="content">
<h1 class="title">Building a Stack</h1>
<div class="container-fluid"><div class="row"><div class="col-md-7 col-md-offset-3 col-xs-12 col-sm-10 col-sm-offset-1 col-lg-6 col-lg-offset-3">
<br><br>

<p>
Building systems is usually seen as a hard topic for senior people only
but it's really something that every engineer should take a hard look
at. By writing programs we are all building some component of a larger
system. This begs the question, why not take the time to focus on
engineering the system itself? Are there ways that we can apply program
level constructs to system design? What would it be like to create
an entire system?
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Systems 101</h2>
<div class="outline-text-2" id="text-1">
<p>
Last month I wrapped up projects for my Senior Web Developer Nanodegree
from Udacity and had a free month to work on whatever I wanted. OK, I
could have jumped straight into the job market but I wanted to dig into
distributed systems while I had the chance. How many times on the job
does an engineer get to build an entire system? Likely none. There's
usually already a system in place or, at best, you'll work with other
people and be left with a subset of the system that you own. That's OK
but how would someone design a system given the opportunity? What kind
of stuff could one learn to get ready for it? What kind of tricks
could you pick up along the way?
</p>

<br>

<p>
As you're probably getting the hint, this was way too tempting not to
investigate. :-)
</p>

<br>

<p>
To begin, I tried categorizing common parts of a system. This won't be
universal since different systems have different objectives but here's a
basic list:
</p>

<ul class="org-ul">
<li>Front-end: Web or App interface to a service
</li>
<li>Back-end: App servers, Web servers, Microservices, 3rd Party, etc.
</li>
<li>Components: Tools for caching, queuing, load balancing, etc.
</li>
<li>Database: How info gets processed and stored long-term and short-term
</li>
<li>Analytics: Data Science things
</li>
<li>OAM: Operations, Administration, and Management
</li>
<li>Computing Platform: Physical servers, OS, Cloud Platform, etc.
</li>
</ul>

<br>

<p>
I've seen some people talk about how putting these parts together is
like snapping LEGO blocks together and magically ending up with a
system. While that would probably work for a mental model, that doesn't
quite carry over to the real world. Much like how programs have errors
and error handling, systems have errors too (network outages, hardware
spontaneously busting, cats accidentally pulling cords out) and the
system has to handle whatever can be thrown at it.
</p>

<br>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Errors</h2>
<div class="outline-text-2" id="text-2">
<p>
The basic trade-off for error handling is described by <a href="https://en.wikipedia.org/wiki/Cap_theorem">CAP
theorem</a>. The gist is that out of the three options of consistency,
availability, or partition tolerance, a system can only have two of
the three. In practice, partition tolerance is always assumed because
people host out of stable data centers that have good uptimes. That
leaves a choice between capacity and availability. I think many
systems end up somewhere in between the two by using eventual
consistency via CRDTs, <a href="https://en.wikipedia.org/wiki/Quorum_(distributed_computing)">quorums</a>, client-side storage, and other techniques.
</p>

<br>

<p>
(Well, people don't always really get partition tolerance because they
usually don't use redundant services to host their systems. It ends up
costing more and the SLAs for hosting usually promise one or two
nines, which is good enough. That said, I've seen major hosting
providers have multi-day outages for a zone which crashed lots of web
services. Just a few weeks ago Dyn DNS went out along with all the
services that used it as a single point of failure: Twitter, GitHub,
Reddit, Paypal, Spotify, and others. Having redundant DNS or hosting
providers could have avoided the problems but it's a design decision
for their system: cost vs fault tolerance.)
</p>

<br>

<p>
There's also the case of acute errors like when an HDD breaks. To
recover from these kinds of problems, the OAM layer should be
monitoring the server's health and handle the problem
automatically. The general idea is that the server will be marked as
down due to hardware failure, the traffic will be distributed to other
servers, and a notification will go out to a human that's on call
somewhere. Runtime exceptions and other normal problems should be
written to a log and possibly ping a team member if it demands attention.
</p>

<br>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Scaling</h2>
<div class="outline-text-2" id="text-3">
<p>
Designing for scale is another tricky challenge. There are usually two
methods of scaling a system: vertically (adding more cores per node)
or horizontally (adding more nodes to a network). Some programming
languages definitely scale better than others but pretty much any
language can be Franken-programmed into scaling both vertically and
horizontally nowadays. Single threaded servers like Node.js can be
hosted with IIS so that each computer core is given an instance of the
server program to run. Load balancers can have different methods to
partition the network load across nodes for horizontal scaling.
</p>

<br>

<p>
<a href="https://www.youtube.com/watch?v=xrIjfIjssLE">Erlang</a>, being the language of distributed systems, is the only
language I'm aware of that can do both horizontal and vertical
scaling. Similar to how Java or C has threads, Erlang has sandboxed
processes. The difference is that a normal computer can support
millions of concurrent Erlang processes and networks can distribute
the processes transparently across nodes. There are lots of other
language features that make <a href="https://www.youtube.com/watch?v=rRbY3TMUcgQ">Erlang</a> great for building systems in
too. For more, I'd highly suggest reading:
</p>

<ul class="org-ul">
<li><a href="http://erlang.org/pipermail/erlang-questions/2014-November/081570.html">this post</a>
</li>
<li><a href="http://erlang.org/download/armstrong_thesis_2003.pdf">the original white paper</a>
</li>
<li><a href="http://learnyousomeerlang.com/content">Learn You Some Erlang for Great Good</a>
</li>
<li><a href="https://www.amazon.com/Designing-Scalability-Erlang-OTP-Fault-Tolerant/dp/1449320732">Designing for Scalability with Erlang/OTP: Implement Robust, Fault-Tolerant Systems</a>
</li>
</ul>

<br>

<p>
Other tools like CDNs, Redis, or Memcache are great for caching static
content for web servers too.
</p>

<br>
</div>
</div>
