resources/public/building-a-stack.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Database</h2>
<div class="outline-text-2" id="text-4">
<p>
There are also all kinds of database problems that happen when scaling a
system. There are basic SQL vs NoSQL arguments that have played out
ad nausem. Then there are complete paradigm shifts like Big Data systems
which use an immutable database to remember everything that
happens. Databases need to be partitioned among network clusters once
they get big enough and they need to take into account CAP theorem
requirements too (e.g. ACID vs BASE vs trade-offs).
</p>

<br>

<p>
The Big Data systems take the approach of an immutable database for a
variety of reasons that can make systems. Here's a general list of pros
and cons for using an immutable database.
</p>

<br>

<p>
benefits of immutable databases:
</p>
<ul class="org-ul">
<li>temporal analysis of things (time series analysis)
</li>
<li>easier to run analysis on data retroactively (everything is open to
analysis, not just key metrics that we care about right now. Take a
snapshot and analyze everything. Audits!)
</li>
<li>aggregating data
</li>
<li>reads can always be done (no read/write synchronization needed since
all data is immutable)
</li>
<li>fast writes
</li>
<li>fast reads (especially with in-memory databases)
</li>
<li>easier to handle scale + fault tolerance with database replication
</li>
<li>choice of underlying database (each has different attributes like
read/write speed or scalability)
</li>
</ul>

<br>

<p>
disadvantages:
</p>
<ul class="org-ul">
<li>more storage space (but space is so cheap right now, right?)
</li>
<li>fewer learning resources
</li>
<li>can be hard to set up if you want lots of features (like try writing
your own Datomic with concurrent transactors that can be tuned for
consistency/availability on top of Riak clusters that also has no
datom limit)
</li>
</ul>

<br>

<p>
I'm personally a fan of Nathan Marz's Lambda Architecture for Big Data
systems. There's a good <a href="https://www.manning.com/books/big-data">book</a> about it from Manning and a nice
<a href="https://www.youtube.com/watch?v=ucHjyb6jv08">talk here</a> (there are other good talks about this too). The main
trade-off here would be a larger learning curve but using Clojure
makes it a little easier at least. In practice, I think a "do things
that don't scale" solution is usually made to get an MVP off the
ground. That usually means making painful, in-flight database updates
to improve the database's latency and throughput as the business
grows. Finally, somewhere down the line, the database becomes scalable
and work on it can switch into maintenance mode.
</p>

<br>

<p>
In the spirit of Rich Hickey's <a href="https://www.infoq.com/presentations/Simple-Made-Easy">simple made easy talk</a>, it might
be better to just eat the upfront development time to learn how to
build Big Data systems (or at least how to engineer a scalable
solution for the database). This is pretty generic and works for most
startup ideas you'll want to try banging out. The long-term
maintenance cost is much lower, which frees up more time to work on
cool stuff or pressing business problems.
</p>

<br>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Analytics</h2>
<div class="outline-text-2" id="text-5">
<p>
I'm not much of a data science person but from what I've seen there
are some tricks that could be used to wring out more info from a
dataset. A new MIT project called the <a href="http://dai.lids.mit.edu/Pred_eng.pdf">Data Science Machine</a> looks like
an interesting approach for creating generic predictions. It promises
to automate much of the work that a data scientist would normally be
hired for.
</p>

<br>

<p>
The general idea is that a dataset will be indexed by time and a
series of functions will form a pipeline that automates much of the
data analysis. There's a <a href="https://www.youtube.com/watch?v=d4f1jzhUjjs">nice video set</a> (complete with really
distracting music) that digs into more detail.
</p>

<br>

<p>
This is another place where keeping an immutable, master dataset will
pay off. In most small startups the analytics system is designed to
capture some key metrics and stash them in a database for analysis
later. With a Big Data style system everything can be analyzed with
time series so nothing is overlooked. That leads to better predictive
analytics and maybe better ways to monetize data for 3rd parties
depending on the industry.
</p>

<br>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Components</h2>
<div class="outline-text-2" id="text-6">
<p>
This part of the system varies widely depending on what domain the
system is for. A good rule might be to treat system components like
stateless functions. They should be reusable parts to transform
values, route values, cache values, or move values. This could be
something like a queue that moves data around and decouples the input
and output processes. RabbitMQ is an example of queue that does just
that. A router example might be an event processor like Storm.
</p>

<br>

<p>
The point is that each part is abstract, composable, uses messaging
protocols for its communication (message sequence diagrams help), and
is reusable.
</p>

<br>

<p>
Another example might be a database abstraction layer that can run
over popular databases. That would allow a team to pick a cheap but
limited database to start out and easily migrate to an enterprise
database later. As long as there's an abstract interface over the
database, the app will never know which database we're actually
building on top of.
</p>

<br>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Back-end</h2>
<div class="outline-text-2" id="text-7">
<p>
Servers should be low latency, high throughput, handle errors, scale,
and all that stuff. There's not a lot I can add here that isn't
already known. Clojure is pretty great since it has relatively
mature tools and access to many Java libraries. I think people
should just use whatever they're comfortable with as long as the
performance is decent. Having a concurrent language is definitely an
added bonus for performance, though.
</p>

<br>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Front-end</h2>
<div class="outline-text-2" id="text-8">
<p>
The public interface to your system! Generally, this is either a
website or an app. Some people are driven to stick with one or the
other ("apps are the future" or "nuh-uh, HTML5 is the best") but it
might be better to be indifferent and do both as is necessary. For a
small company starting out, Progressive Web Apps are probably the path
of least resistance.
</p>

<br>

<p>
For the last half a year I've been working on Progressive Web Apps in
Udacity's Senior Web Developer Nanodegree program. The general idea is
to make a web app that can be downloaded to the home screen for mobile
devices and desktop and have as much parity with native apps as
possible. The app should have native features like a splash screen on
startup, push notifications, offline usage, and have good performance
(no jank). The development time for a PWA is not much more than a
normal web app but the reach is pretty great! It also has other
advantages like using less bandwidth for installs (an actual problem
for developing countries), not needing to be vetted by an app store
review for every update, and, hey, you end up with an app that can
install to homescreen on desktops too.
</p>

<br>

<p>
Eventually, if a business takes off it would make sense to hunker down
and write native apps. PWAs aren't really a replacement for that. This
could be a cheaper way to get rolling though and could be a better
solution for some developing parts of the world.
</p>

<br>
</div>
</div>
