resources/www/building-a-stack.org
* Computing Platform

  How many options are there for hosting providers? Probably a
  billion. After taking a look at the choices between cloud,
  co-location, and self-hosting, my choice for kicking something off
  would be to just self-host. Minneapolis has 1Gbps or 10Gbps speeds for
  cheap (like my $70/month 6Mpbs connection costs more than
  1Gpbs). It's usually not a good idea to run things
  yourself because power outages and general bad things will probably
  happen.

#+HTML: <br>

  I think Co-location is probably the most reasonable for a longer term
  plan. Once the traffic on a service stabilizes, it is much cheaper to
  get your own hardware and use a co-location centre. Cloud
  hosting can be used to handle traffic spikes but is pretty
  expensive. The obvious exception is if you're in a super disruptive
  startup that does hockey stick growth. Then the cloud hosting option
  would probably be a better fit.

#+HTML: <br>

  I did a little poking around for how to get good server prices and
  eBay seems to be the most reasonable. Buying up used 1U blade servers
  to start with is a pretty good deal. Costs for hardware seem to rise
  exponentially, so the best approach is definitely going with commodity
  hardware.

#+HTML: <br>

  For the OS decision, I think we can make a list of some functional
  requirements:

  - easy to set up
  - doesn't hog resources
  - can update well
  - works with a hosted cloud service (just in case)
  - can handle ZFS
  - is mature and has good support

  The easiest I can think of is using [[https://www.joyent.com/smartos][SmartOS]] since it can run docker
  containers directly on bare metal. SmartOS can be dd-ed onto a flash
  drive and loaded directly into RAM. That's nice because it doesn't run
  off the disk and has a small memory footprint. It's been around for a
  while and is a derivative of Illumos (which comes from OpenSolaris) so
  support is good too. There's a nice description [[https://www.youtube.com/watch?v=dxZExLeJz2I][here]].

#+HTML: <br>

  Basically, getting rid of VM the overhead translates into [[https://mattconnolly.wordpress.com/2012/11/18/comparing-amazon-ec2-to-joyent-smartos/][better]]
  [[https://www.joyent.com/blog/joyent-and-hadoop-making-big-data-better][speeds]]. Joyent also offers a platform for better ops automation
  [[https://www.joyent.com/blog/docker-bake-off-aws-vs-joyent][throughout]].

#+HTML: <br>

  Being a [[https://www.youtube.com/watch?v=mPhjFYXoAD0][cloud native solution]] is really nice for efficiency and more
  importantly system level automation!

#+HTML: <br>

* OAM

  In getting the hang of Erlang over the past month, I noticed that it
  has some awesome tools for administration and management. Here's a list
  of most of the things it can do:

  - an OS heartbeat script to monitor nodes
  - automatically restart processes or full nodes if they become
    unresponsive
  - live code updates and rollbacks
  - an Erlang shell that can jack into any remote processes

#+HTML: <br>

  Kubernetes offers something pretty similar:
  - health monitoring for nodes
  - automatic restart when a node becomes unresponsive
  - handles load balancing for health and readiness of nodes
  - code deploys and rollbacks
  - command line interface

#+HTML: <br>

  These both work great for managing container deploys but not so great
  for system level operations, administration, and management. Luckily,
  [[https://docs.project-fifo.net/][Project FIFo]] and [[https://www.joyent.com/triton][Triton]] are open source projects for handling just
  that on SmartOS systems.

#+HTML: <br>

  I haven't had enough time to really evaluate whether one is better
  than the other. Both look like interesting solutions for managing a
  private cloud datacenter, though.

#+HTML: <br>

  Cloud providers like AWS offer tools for OAM tasks with the obvious
  problem that they only work with their service. There's no option to
  use them in your own datacenter.

#+HTML: <br>

  There are many other tools that work for OAM but they are more complex
  to integrate with SmartOS. There are already enough services provided
  by ProjectFIFo/Triton, Kubernetes, and Docker. Stitching together five
  or six separate tools to try building the same thing would be a large
  time sync and bring more maintenance overhead.

#+HTML: <br>

* Extra Hardware Hacks

  I came up with a few other ideas that were much more experimental while
  playing around with how to build the infrastructure. These were mostly
  solutions for rich man's problems (e.g. needing petabytes of storage)
  and not things to worry about in the early stages of a startup.

#+HTML: <br>

  For storage space, I like the BACKBLAZE team's plan to make a
  [[https://www.backblaze.com/blog/petabytes-on-a-budget-how-to-build-cheap-cloud-storage/][petabyte scale storage server]]. They crammed 45 HDDs into a box and
  added some hardware, which in 2009 only added up to 76TB. Now that we
  have 4TB disks it should be 45 * 4 (180TB). Pretty awesome!

#+HTML: <br>

  Since the storage servers would likely hold the master dataset for
  Hadoop, we could compress things since speed is less important for the
  batch processing layer. By default HDFS (Hadoop filesystem) uses gzip
  for compression so there's already some savings. To add to that, we could
  use a ZFS filesystem and get a bit more compression for cheap
  too. Hopefully, that could significantly bump storage for the server!

#+HTML: <br>

  (Having that amount of storage is definitely a rich man's problem. For
  starting a company, it's obviously better to use minimal storage and see
  where things go.)

#+HTML: <br>

  There are other cool looking hardware hacks with FPGAs that could save
  money too. RAM seems to be an important hardware component that
  limits the system because it's so darn expensive. One way to work
  around that might be to have a ram cloud using
  [[http://dspace.mit.edu/handle/1721.1/97746][BlueDBM]]. The project basically promotes using a rack of SSDs with an
  FPGA as a replacement for RAM. The read time on the system is slightly
  slower than normal DRAM but it consumes less power and is an order of
  magnitude cheaper.

#+HTML: <br>

  If the Lambda Architecture was used, maybe it would be reasonable to
  use a RAM cloud for the serving layer. The serving layer holds a view
  that was created from the master dataset. It's an immutable snapshot,
  so maybe it would be conceivable to store the entire database in the
  RAM cloud using something like Voldemort. Doing that might yield low
  latency reads with higher throughput.

#+HTML: <br>

  (OK, this is a super rich man's problem. Mostly just fun to read and
  think about. This part is super experimental anyway and probably
  wouldn't work.)

#+HTML: <br>

