resources/public/building-a-stack.html

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Computing Platform</h2>
<div class="outline-text-2" id="text-9">
<p>
How many options are there for hosting providers? Probably a
billion. After taking a look at the choices between cloud,
co-location, and self-hosting, my choice for kicking something off
would be to just self-host. Minneapolis has 1Gbps or 10Gbps speeds for
cheap (like my $70/month 6Mpbs connection costs more than
1Gpbs). It's usually not a good idea to run things
yourself because power outages and general bad things will probably
happen.
</p>

<br>

<p>
I think Co-location is probably the most reasonable for a longer term
plan. Once the traffic on a service stabilizes, it is much cheaper to
get your own hardware and use a co-location centre. Cloud
hosting can be used to handle traffic spikes but is pretty
expensive. The obvious exception is if you're in a super disruptive
startup that does hockey stick growth. Then the cloud hosting option
would probably be a better fit.
</p>

<br>

<p>
I did a little poking around for how to get good server prices and
eBay seems to be the most reasonable. Buying up used 1U blade servers
to start with is a pretty good deal. Costs for hardware seem to rise
exponentially, so the best approach is definitely going with commodity
hardware.
</p>

<br>

<p>
For the OS decision, I think we can make a list of some functional
requirements:
</p>

<ul class="org-ul">
<li>easy to set up
</li>
<li>doesn't hog resources
</li>
<li>can update well
</li>
<li>works with a hosted cloud service (just in case)
</li>
<li>can handle ZFS
</li>
<li>is mature and has good support
</li>
</ul>

<p>
The easiest I can think of is using <a href="https://www.joyent.com/smartos">SmartOS</a> since it can run docker
containers directly on bare metal. SmartOS can be dd-ed onto a flash
drive and loaded directly into RAM. That's nice because it doesn't run
off the disk and has a small memory footprint. It's been around for a
while and is a derivative of Illumos (which comes from OpenSolaris) so
support is good too. There's a nice description <a href="https://www.youtube.com/watch?v=dxZExLeJz2I">here</a>.
</p>

<br>

<p>
Basically, getting rid of VM the overhead translates into <a href="https://mattconnolly.wordpress.com/2012/11/18/comparing-amazon-ec2-to-joyent-smartos/">better</a>
<a href="https://www.joyent.com/blog/joyent-and-hadoop-making-big-data-better">speeds</a>. Joyent also offers a platform for better ops automation
<a href="https://www.joyent.com/blog/docker-bake-off-aws-vs-joyent">throughout</a>.
</p>

<br>

<p>
Being a <a href="https://www.youtube.com/watch?v=mPhjFYXoAD0">cloud native solution</a> is really nice for efficiency and more
importantly system level automation!
</p>

<br>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">OAM</h2>
<div class="outline-text-2" id="text-10">
<p>
In getting the hang of Erlang over the past month, I noticed that it
has some awesome tools for administration and management. Here's a list
of most of the things it can do:
</p>

<ul class="org-ul">
<li>an OS heartbeat script to monitor nodes
</li>
<li>automatically restart processes or full nodes if they become
unresponsive
</li>
<li>live code updates and rollbacks
</li>
<li>an Erlang shell that can jack into any remote processes
</li>
</ul>

<br>

<p>
Kubernetes offers something pretty similar:
</p>
<ul class="org-ul">
<li>health monitoring for nodes
</li>
<li>automatic restart when a node becomes unresponsive
</li>
<li>handles load balancing for health and readiness of nodes
</li>
<li>code deploys and rollbacks
</li>
<li>command line interface
</li>
</ul>

<br>

<p>
These both work great for managing container deploys but not so great
for system level operations, administration, and management. Luckily,
<a href="https://docs.project-fifo.net/">Project FIFo</a> and <a href="https://www.joyent.com/triton">Triton</a> are open source projects for handling just
that on SmartOS systems.
</p>

<br>

<p>
I haven't had enough time to really evaluate whether one is better
than the other. Both look like interesting solutions for managing a
private cloud datacenter, though.
</p>

<br>

<p>
Cloud providers like AWS offer tools for OAM tasks with the obvious
problem that they only work with their service. There's no option to
use them in your own datacenter.
</p>

<br>

<p>
There are many other tools that work for OAM but they are more complex
to integrate with SmartOS. There are already enough services provided
by ProjectFIFo/Triton, Kubernetes, and Docker. Stitching together five
or six separate tools to try building the same thing would be a large
time sync and bring more maintenance overhead.
</p>

<br>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">Extra Hardware Hacks</h2>
<div class="outline-text-2" id="text-11">
<p>
I came up with a few other ideas that were much more experimental while
playing around with how to build the infrastructure. These were mostly
solutions for rich man's problems (e.g. needing petabytes of storage)
and not things to worry about in the early stages of a startup.
</p>

<br>

<p>
For storage space, I like the BACKBLAZE team's plan to make a
<a href="https://www.backblaze.com/blog/petabytes-on-a-budget-how-to-build-cheap-cloud-storage/">petabyte scale storage server</a>. They crammed 45 HDDs into a box and
added some hardware, which in 2009 only added up to 76TB. Now that we
have 4TB disks it should be 45 * 4 (180TB). Pretty awesome!
</p>

<br>

<p>
Since the storage servers would likely hold the master dataset for
Hadoop, we could compress things since speed is less important for the
batch processing layer. By default HDFS (Hadoop filesystem) uses gzip
for compression so there's already some savings. To add to that, we could
use a ZFS filesystem and get a bit more compression for cheap
too. Hopefully, that could significantly bump storage for the server!
</p>

<br>

<p>
(Having that amount of storage is definitely a rich man's problem. For
starting a company, it's obviously better to use minimal storage and see
where things go.)
</p>

<br>

<p>
There are other cool looking hardware hacks with FPGAs that could save
money too. RAM seems to be an important hardware component that
limits the system because it's so darn expensive. One way to work
around that might be to have a ram cloud using
<a href="http://dspace.mit.edu/handle/1721.1/97746">BlueDBM</a>. The project basically promotes using a rack of SSDs with an
FPGA as a replacement for RAM. The read time on the system is slightly
slower than normal DRAM but it consumes less power and is an order of
magnitude cheaper.
</p>

<br>

<p>
If the Lambda Architecture was used, maybe it would be reasonable to
use a RAM cloud for the serving layer. The serving layer holds a view
that was created from the master dataset. It's an immutable snapshot,
so maybe it would be conceivable to store the entire database in the
RAM cloud using something like Voldemort. Doing that might yield low
latency reads with higher throughput.
</p>

<br>

<p>
(OK, this is a super rich man's problem. Mostly just fun to read and
think about. This part is super experimental anyway and probably
wouldn't work.)
</p>

<br>
</div>
</div>
