resources/www/building-a-stack.org
* Conclusion

  This post was a general overview of how to engineer a system
  architecture and some of the design tradeoffs that come with it. I
  tried to keep from talking too much about any one layer to instead lay
  out a rough roadmap of the system. Each part has more detail and lower
  level design decisions that were glossed over. Some topics like
  networking also were skipped to focus on other parts.

#+HTML: <br>

  I didn't talk about other ideas like the [[https://12factor.net/][12 factor app model]] either
  but hopefully you can draw your own parallels between this design and
  that model.

#+HTML: <br>

  Before writing this up I was focusing on Erlang and building a system
  infrastructure for a startup idea. I wanted to write things down
  to see what other people thought. Sorry if parts were more focused on
  my design choices and less on general patterns. My goal was to make a
  generic stack based on the Lambda Architecture that could be reused
  for a few companies.

#+HTML: <br>

  It's fun to try picking which technologies to use and then jumping in
  to work on it. I hope my notes help elucidate some of the process!

#+HTML: <br><br>
#+HTML: <div id="disqus_thread"></div> <script> var disqus_config = function () { this.page.url = "https://edbabcock.com"; this.page.identifier = "building-a-stack"; }; (function() { var d = document, s = d.createElement('script'); s.src = '//edbabcock-com.disqus.com/embed.js'; s.setAttribute('data-timestamp', +new Date()); (d.head || d.body).appendChild(s); })(); </script> <noscript>It would be better if comments didn't need JS. Turn JavaScript on to see the comments. <a href="https://disqus.com/?ref_noscript">Comments powered by Disqus.</a></noscript>

#+HTML: <br>
#+HTML: </div></div></div>
