resources/public/building-a-stack.html

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">Conclusion</h2>
<div class="outline-text-2" id="text-12">
<p>
This post was a general overview of how to engineer a system
architecture and some of the design tradeoffs that come with it. I
tried to keep from talking too much about any one layer to instead lay
out a rough roadmap of the system. Each part has more detail and lower
level design decisions that were glossed over. Some topics like
networking also were skipped to focus on other parts.
</p>

<br>

<p>
I didn't talk about other ideas like the <a href="https://12factor.net/">12 factor app model</a> either
but hopefully you can draw your own parallels between this design and
that model.
</p>

<br>

<p>
Before writing this up I was focusing on Erlang and building a system
infrastructure for a startup idea. I wanted to write things down
to see what other people thought. Sorry if parts were more focused on
my design choices and less on general patterns. My goal was to make a
generic stack based on the Lambda Architecture that could be reused
for a few companies.
</p>

<br>

<p>
It's fun to try picking which technologies to use and then jumping in
to work on it. I hope my notes help elucidate some of the process!
</p>

<br>
</div></div></div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer> <hr />
                         <p><a href='http://creativecommons.org/licenses/by-nc-sa/3.0/' target='_blank'>©copyright 2015</a>, by <a href='/about.html'>Ed Babcock</a> (^_^)v</p>
                         </footer>
                         <script type='text/javascript' src='js/jquery.min.js'></script>
                         <script type='text/javascript' src='js/bootstrap.min.js'></script>
</div>
</body>
</html>
